Repository: progserega/matrix-reaction-signature-bot
Catalog: translate/commands_*.po
Languages: ru

source: help
ru: помощь

source: I am admin reaction bot. 1. help - this help 2. add_signature - add signature to user 3. enable_signature - enable/disable showing signature for user 4. show_signature - show signature for user 5. clear_signature - clear signature for user 6. add_rule_interruption - increment rule interruption 7. show_rule_interruption_stat - show active/all rule interruption count for user 8. show_active_rule_interruption_descr - show active rule interruption description (for all interruption) - be cafule with many active interruption for user - bot will spam messages 9. show_old_rule_interruption_descr - show old (not active) rule interruption description (for all old interruption) - be cafule with many old not active interruption for user - bot will spam messages 10. clear_active_rule_interruption - clear active rule interruption count (when unban user) 11. set_locale - change language of bot for this room 12. set_my_descr - set own description for user (can do only mxid for it's mxid) 13. show_user_descr - show description for user 14. clear_user_descr - clear description for user 15. version - show version
ru: Я информационный бот. 1. помощь - эта помощь 2. подпись - добавить подпись пользователю 3. вкл_подпись - вкл./выкл.отображение подписи для пользователя 4. показать_подпись - отобразить какая у пользователя подпись 5. очистка_подписи - очистить подпись у пользователя 6. замечание - добавить замечание пользователю 7. статистика_замечаний - отобразить счётчик активных/всех замечаний для пользователя 8. показать_описание_активных_замечаний - отобразить описания всех активных замечаний (будьте осторожны в случае большого количества замечаний - бот может завалить комнату сообщениями (проверьте сначала количество замечаний командой 'статистика_замечаний' 9. показать_описание_неактивных_замечаний - отобразить описания всех неактивных замечаний (будьте осторожны в случае большого количества замечаний - бот может завалить комнату сообщениями (проверьте сначала количество замечаний командой 'статистика_замечаний' 10. очистить_счётчик_активных_замечаний - замечания перейдут в статус "неактивные" и не будут показываться в подписи пользователя 11. язык - поменять язык, на котором я говорю 12. установить_моё_описание - установить собственное описание для своего же mxid/ника 13. показать_описание_пользователя - показать собственное описание пользователя 14. очистить_описание_пользователя - очистить описание другого пользователя 15. версия - показать описание версии

source: version
ru: версия

source: too long version descr - crop...
ru: слишком длинное описание версии - обрезаю...

source: See full version at: https://github.com/progserega/matrix-reaction-signature-bot/blob/main/CHANGELOG.md
ru: Смотрите полное описание историй версий на сайте: https://github.com/progserega/matrix-reaction-signature-bot/blob/main/CHANGELOG.md

source: Version of bot: %s
ru: Версия бота: %s

source: set_locale
ru: язык

source: you need more power level for this command
ru: вам не хватает прав для выполнения этой команды

source: This command allow switch language for this room. command `set_locale` need 1 param: locale. Locale can be 'ru', 'us', etc. syntax: my_botname_in_this_room: set_locale locale example: rsbot: set_locale ru
ru: Эта команда позволяет переключить язык бота. команде `язык` нужен 1 параметр: локаль. Локаль может быть: 'ru', 'us', 'en', и т.д. синтаксис: ник_бота: язык код_локали пример: rsbot: язык ru

source: unsupported locale name '%s'. Try 'en' or 'ru' for example.
ru: неподдерживаемое имя локали '%s'. Попробуйте 'en' или 'ru'.

source: internal error in function:
ru: внутренняя ошибка в функции:

source: enable_signature
ru: вкл_подпись

source: This command disable or enable showing signature for user. Disabling - is not delete signature in db, but it will not be show. command `enable_signature` need 2 params. syntax: my_botname_in_this_room: enable_signature user_name_for_signature yes/no example: rsbot: enable_signature Baduser yes
ru: Эта команда включает или отключает показ подписи у пользователя. команде `вкл_подпись` нужено 2 параметра. синтаксис: ник_бота: вкл_подпись ник_пользователя/mxid_да/нет пример: rsbot: вкл_подпись Максим нет

source: nickname %s not uniqum in this room. Please, select user by mxid (as @user:server.com)
ru: ник %s не уникален в этой комнате. Пожалуйста, выберите пользователя по mxid (т.е.: @user:server.com)

source: nickname %s not known. Please, correct, or select user by mxid (as @user:server.com)
ru: ник %s неизвестен. Пожалуйста, скорректируйте его или выберите пользователя по его mxid (т.е. @user:server.com)

source: yes
ru: да

source: success enable signature to user %s
ru: успешно включил отображение подписи для пользователя %s

source: success disable signature to user %s
ru: успешно отключил отображение подписи для пользователя %s

source: add_rule_interruption
ru: замечание

source: command `add_rule_interruption` need 2 params. syntax: my_botname_in_this_room: add_rule_interruption user_name_for_inc_rule_interruption "description - Why rule is interrupt" example: rsbot: add_rule_interruption Baduser "rule paragraph 3 at message url: https://matrix.to/#/!tBHU3434554VVVfuMP:matrix.org/$UV232444VR8-F9ch3eAZxlG2nUdakJXDMfYETdZVYCQ?via=matrix.org"
ru: команде `замечание` нужно 2 параметра. синтаксис: ник_бота: замечание ник_пользователя "описание из-за чего выдано замечание" пример: rsbot: замечание Максим"нарушение параграфа 3 правил в сообщении по ссылке: https://matrix.to/#/!tBHU3434554VVVfuMP:matrix.org/$UV232444VR8-F9ch3eAZxlG2nUdakJXDMfYETdZVYCQ?via=matrix.org"

source: success add rule_interruption to user %s
ru: успешно добавил замечание пользователю %s

source: clear_signature
ru: очистка_подписи

source: command `clear_signature` need 1 params. syntax: my_botname_in_this_room: clear_signature user_name_for_signature example: rsbot: clear_signature goodUser
ru: эта команда очищает подпись у пользователя. команде `очистка_подписи` нужен 1 параметр. синтаксис: ник_бота: очистка_подписи ник_пользователя/mxid_пользователя пример: rsbot: очистка_подписи Максим

source: success clear signature for user %s
ru: успешно очистил подпись у пользователя %s

source: add_signature
ru: подпись

source: command `add_signature` need 3 params. syntax: my_botname_in_this_room: add_signature user_name_for_signature signature_text "description - Why signature added to user" example: rsbot: add_signature Baduser "spammer" "This user spam in this room!"
ru: команда добавляет подпись пользователю. команде `подпись` нужно 3 параметра. синтаксис: ник_бота: подпись ник_пользователя/mxid_пользователя "текст подписи" "описание - почему эта подпись дана" пример: rsbot: подпись Максим провокатор "вбрасывает лживые ссылки, признаёт это, но продолжает делать, чтобы наблюдать за реакцией других пользователей"

source: success add signature to user %s
ru: успешно добавил подпись пользователю %s

source: show_signature
ru: показать_подпись

source: This command show signature record for user. command `show_signature` need 1 params. syntax: my_botname_in_this_room: show_signature user_name example: rsbot: show_signature Baduser
ru: Эта команда отображает подпись пользователя. команде `показать_подпись` нужен 1 параметр. синтаксис: ник_бота: показать_подпись ник_пользователя/mxid_пользователя пример: rsbot: показать_подпись Максим

source: internal error sql.check_user_exist()
ru: внутренняя ошибка sql.check_user_exist()

source: internal error sql.get_signature_descr()
ru: внутренняя ошибка sql.get_signature_descr()

source: User %(signature_user_mxid)s: 1. signature: %(signature)s 2. Author of signature: %(signature_author)s 3. Time create/update of signature: %(signature_time_create)s 4. Show signature: %(signature_show)s 5. Description signature: %(signature_descr)s
ru: Пользователь %(signature_user_mxid)s: 1. подпись: %(signature)s 2. Автор подписи: %(signature_author)s 3. Время создания/обновления подписи: %(signature_time_create)s 4. Показывать подпись: %(signature_show)s 5. Описание подписи: %(signature_descr)s

source: show_rule_interruption_stat
ru: статистика_замечаний

source: This command show rule interruption stat for user. command `show_rule_interruption_stat` need 1 params. syntax: my_botname_in_this_room: show_rule_interruption_stat user_name example: rsbot: show_rule_interruption_stat Baduser
ru: Эта команда отображает статистику замечаний пользователя. команде `статистика_замечаний` нужен 1 параметр. синтаксис: ник_бота: статистика_замечаний ник_пользователя/mxid_пользователя пример: rsbot: статистика_замечаний Максим

source: no such user in db: %s
ru: нет такого пользователя в базе: %s

source: User %(signature_user_mxid)s have: 1. active rule interruption: %(active_rule_interruption)d 2. all rule interruption: %(all_rule_interruption)d
ru: Пользователь %(signature_user_mxid)s имеет: 1. Активных замечаний: %(active_rule_interruption)d 2. Всего замечаний: %(all_rule_interruption)d

source: show_active_rule_interruption_descr
ru: показать_описание_активных_замечаний

source: This command show description for active rule interruption for user. command `show_active_rule_interruption_descr` need 1 params. syntax: my_botname_in_this_room: show_active_rule_interruption_descr user_name example: rsbot: show_active_rule_interruption_descr Baduser
ru: Эта команда отображает описание активных замечаний пользователя. команде `показать_описание_активных_замечаний` нужен 1 параметр. синтаксис: ник_бота: показать_описание_активных_замечаний ник_пользователя/mxid_пользователя пример: rsbot: показать_описание_активных_замечаний Максим

source: no active rule interruptions for user %s
ru: нет активных замечаний у пользователя %s

source: Admin %(admin)s at %(date)s add rule interruption by user %(signature_user_mxid)s with descr: %(descr)s
ru: Администратор %(admin)s в %(date)s добавил замечание пользователю %(signature_user_mxid)s со следующим описанием: %(descr)s

source: show_old_rule_interruption_descr
ru: показать_описание_неактивных_замечаний

source: This command show description for old (not active) rule interruption for user. command `show_old_rule_interruption_descr` need 1 params. syntax: my_botname_in_this_room: show_old_rule_interruption_descr user_name example: rsbot: show_old_rule_interruption_descr Baduser
ru: Эта команда отображает описание неактивных замечаний пользователя. команде `показать_описание_неактивных_замечаний` нужен 1 параметр. синтаксис: ник_бота: показать_описание_неактивных_замечаний ник_пользователя/mxid_пользователя пример: rsbot: показать_описание_неактивных_замечаний Максим

source: no old rule interruptions for user %s
ru: нет старых (неактивных) замечаний для пользователя %s

source: clear_active_rule_interruption
ru: очистить_счётчик_активных_замечаний

source: This command clear active rule interruptions for user. They will become as not active. command `clear_active_rule_interruption` need 1 param. syntax: my_botname_in_this_room: clear_active_rule_interruption user_name example: rsbot: clear_active_rule_interruption Baduser
ru: Эта команда очищает число активных замечаний пользователя. команде `очистить_счётчик_активных_замечаний` нужен 1 параметр. синтаксис: ник_бота: очистить_счётчик_активных_замечаний ник_пользователя/mxid_пользователя пример: rsbot: очистить_счётчик_активных_замечаний Максим

source: success clear active rule interruptions for user %s
ru: успешно очистил счётчик активных нарушений для пользователя %s

source: set_my_descr
ru: установить_моё_описание

source: command `set_my_descr` need 1 params. Command set own description for user. This can do only some user for self. syntax: my_botname_in_this_room: set_my_descr "description of me" example: rsbot: set_my_descr "I am good user. My github url: xxxx, My social url: xxxx"
ru: команде `установить_моё_описание` нужен один параметр. Команда устанавливает личное описание для пользователя. синтаксис: ник_бота: установить_моё_описание "моё описание" пример: rsbot: установить_моё_описание "моя страничка в социальных сетях: http://vk.com/43434

source: success add user_descr to user %s
ru: успешно установил описание для пользователя %s

source: show_user_descr
ru: показать_описание_пользователя

source: command `show_user_descr` need 1 params. Command show own description for user. This description was seted user for self. syntax: my_botname_in_this_room: show_user_descr username examples: rsbot: show_user_descr UserNick rsbot: show_user_descr @user:server
ru: команда отображает описание пользователя, которое он сам себе установил. команде `показать_описание_пользователя` нужен 1 параметр. синтаксис: ник_бота: показать_описание_пользователя ник_пользователя/mxid_пользователя пример: rsbot: показать_описание_пользователя Максим

source: User '%s' has no own description
ru: Пользователь '%s' не имеет собственного описания

source: User description for user '%s' is: %s
ru: Собственное описание пользователя '%s': %s

source: clear_user_descr
ru: очистить_описание_пользователя

source: This command clear user description. This can do only administrator or moderator. command `clear_user_descr` need 1 params. syntax: my_botname_in_this_room: clear_user_descr user_name example: rsbot: clear_user_descr Baduser
ru: Эта команда очищает описание пользователя. Это может делать только администратор (пользователь может просто установить пустое описание, если хочет очистить своё описание) команда `очистить_описание_пользователя` нужен 1 параметр. синтаксис: ник_бота: очистить_описание_пользователя имя_пользователя пример: rsbot: очистить_описание_пользорвателя Максим

source: success clear user_descr to user %s
ru: успешно очистил описание пользователя %s

source: unknown command! Please, use 'help' or empty command (only my room nick name) for help.
ru: неизвестная команда! Пожалуйста, используйте команду 'помощь' или обратитесь ко мне без команды (только мой ник) для получения справки.
